fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышаетНорму</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТабличнойЧасти

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПересчитатьПревышениеНормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	ДанныеОтпусков = СобратьДанныеОтпусков();
	АдресДанных = ПоместитьДанныеВоВременноеХранилище(ДанныеОтпусков);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
	ПараметрыФормы.Вставить("Год",         Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьПревышениеНормы()
	
	СуммыПоСотрудникам = Новый Соответствие;
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ДатаНачала) Или НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Длительность = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
		ТекущаяСумма = СуммыПоСотрудникам[Строка.Сотрудник];
		Если ТекущаяСумма = Неопределено Тогда
			СуммыПоСотрудникам.Вставить(Строка.Сотрудник, Длительность);
		Иначе
			СуммыПоСотрудникам[Строка.Сотрудник] = ТекущаяСумма + Длительность;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Строка.ПревышаетНорму = Ложь;
			Продолжить;
		КонецЕсли;
		
		Сумма = СуммыПоСотрудникам[Строка.Сотрудник];
		Строка.ПревышаетНорму = (Сумма <> Неопределено И Сумма > 28);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СобратьДанныеОтпусков()
	
	Таблица = Новый Массив;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
		Запись.Сотрудник     = Строка.Сотрудник;
		Запись.ДатаНачала    = Строка.ДатаНачала;
		Запись.ДатаОкончания = Строка.ДатаОкончания;
		
		Таблица.Добавить(Запись);
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

&НаКлиенте
Функция ПоместитьДанныеВоВременноеХранилище(Данные)
	
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
